def is_work?
  return File.exist?("/Users/maisiebell/src/github.com/monzo")
end

brew "bat"
brew "carapace" # Shell completion
brew "chafa" # Generate ASCII images
brew "ctags"
brew "doctl" # DigitalOcean CLI
brew "fd" # Better find tools
brew "ffmpeg"
brew "fnm" unless is_work? # Better nvm
brew "fzf" # Fuzzy finder
brew "gh"
brew "git-lfs"
brew "glow"
brew "gnupg"
brew "go"
brew "golang-migrate" unless is_work?
brew "htop"
brew "hub"
brew "imagemagick"
brew "jq"
brew "lazygit"
brew "neovim", args: ["HEAD"] # v0.12.0
brew "openapi"
brew "pinentry-mac"
brew "pkgconf"
brew "pngpaste"
brew "postgis" unless is_work? # Geospatial data in postgresql
brew "postgresql@17", restart_service: :changed, link: true unless is_work?
brew "pyenv"
brew "r"
brew "ranger"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "rust"
brew "sqlc"
brew "starship"
brew "stow"
brew "swig"
brew "tfenv"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "tree-sitter-cli"
brew "wget"
brew "yq"
brew "z"
brew "zoxide"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"
cask "font-fantasque-sans-mono-nerd-font"
cask "font-iosevka-nerd-font"
cask "kitty"

unless is_work?
  cask "1password"
  cask "1password-cli"
  cask "blender"
  cask "container"
  cask "calibre"
  cask "figma"
  cask "google-chrome"
  cask "keybase"
  cask "mactex-no-gui"
  cask "quarto"
  cask "signal"
  cask "slicer"
  cask "vnc-viewer"
  cask "zoom"
  cask "font-stack-sans-text"
  cask "font-stack-sans-notch"
  cask "font-stack-sans-headline"
  cask "font-gohufont-nerd-font"
end
